{
  "beam_fixed_pin_support_point_loads.png": {
    "suggested_name": "beam_fixed_pin_support_point_loads",
    "description": "Horizontal beam with two support conditions shown in the context of structures and stress tensor analysis. The beam features a fixed support (indicated by hatching) at the left end, preventing both translation and rotation. At approximately mid-span, there is a pinned/hinged support (shown as a triangular symbol with hatching below) that prevents vertical translation while allowing rotation. The beam extends beyond the pin support to the right end. Two vertical point loads are indicated: one labeled \"Q\" at the left end near the fixed support, and another labeled \"Q\" at the right free end of the beam. The diagram is drawn on a grid background and represents a statically indeterminate beam configuration used for stress analysis, as indicated by the page context showing equilibrium equations and stress tensor notation."
  },
  "curved_element_distributed_forces_equilibrium.png": {
    "suggested_name": "curved_element_distributed_forces_equilibrium",
    "description": "Equilibrium diagram of a curved structural element resembling a figure-eight or dumbbell shape with two bulbous ends connected by a narrower middle section containing a circular feature. The element is subjected to distributed loading shown by multiple vertical arrows: upward arrows along the top surface of both bulbous sections and downward arrows along the bottom surfaces, representing pressure or distributed forces acting normal to the curved boundaries. A concentrated downward force labeled \"Q\" is applied at the center circular feature. The diagram illustrates force equilibrium on a closed curved boundary, with the pattern of distributed forces suggesting internal pressure or external loading conditions. The sketch is labeled \"EQUILIBRIUM\" at the top and appears in the context of analyzing equilibrium requirements for curved structural elements with complex geometry."
  },
  "beam_support_configurations_comparison.png": {
    "suggested_name": "beam_support_configurations_comparison",
    "description": "Comparison diagram showing two horizontal beam configurations with different support conditions, both subjected to a vertical downward point load F. Left configuration: beam with fixed support (hatched vertical wall symbol) at left end and a pinned support (triangular symbol with hatching) at an interior location, with load F applied between the supports. Right configuration: beam with pinned support (circular symbol with radiating lines) at left end and pinned support (triangular symbol with hatching) at an interior location, with load F applied at the right free end. Both diagrams show the beams as horizontal lines with support symbols clearly marked. The configurations represent different statically determinate or indeterminate beam systems used for comparing structural behavior under point loading. The page context includes equilibrium equations and free body diagram analysis with reaction forces H and R, and moment equilibrium expressions involving distance d₁ and length ℓ."
  },
  "truss_and_beam_configurations.png": {
    "suggested_name": "truss_and_beam_configurations",
    "description": "Two structural configurations shown side by side. Left: triangular truss structure with apex at top center where vertical downward point load F is applied. The truss has three pin joints (shown as small circles): one at the apex under the load, and two at the base corners. Two inclined members connect the apex to the base joints, forming an isosceles triangle. The base joints are labeled with symbols suggesting pinned supports. Right: horizontal beam with three support locations marked by circular symbols (pins/hinges). A vertical downward point load F is applied at the center of the beam between the left and middle supports. The beam extends from a pinned support at the left end, through a middle pin support, to a pinned support at the right end. Both configurations represent different approaches to supporting a vertical load F, illustrating truss versus beam structural systems."
  }
}