{
  "semi_monocoque_fuselage_structure.png": {
    "suggested_name": "semi_monocoque_fuselage_structure",
    "description": "Isometric and cross-sectional views of a semi-monocoque fuselage structure illustrating LAB 7 concepts. Left diagram shows 3D perspective of fuselage segment with labeled components: ribs (transverse frames), skins (outer shell), stringers (longitudinal stiffeners), and spar (main structural beam). Right diagram shows cross-sectional view with four corner points labeled q₁, q₂, q₃, q₄ representing shear flow distribution around the perimeter. The diagram illustrates the fundamental structural arrangement where thin skins are supported by longitudinal stringers and transverse ribs, characteristic of aircraft fuselage construction. Below the diagrams is the heading \"Semi-Monocoque Assumptions:\" indicating this is an educational illustration of idealized structural behavior."
  },
  "rectangular_section_centroid.png": {
    "suggested_name": "rectangular_section_centroid",
    "description": "Rectangular cross-section with dimensions a (height) and b (width) showing coordinate system and centroid location. Four corner points marked with circles. Coordinate axes shown with origin at lower left corner: x-axis horizontal (rightward), y-axis vertical (upward). Red arrows labeled A₁ and x̄₁ indicate area element and centroid position. Dimension b/2 marked at top indicating half-width. This diagram is used for calculating geometric properties (centroid location, moments of inertia) of rectangular sections in structural analysis, as indicated by the surrounding equations for centroid coordinates x̄c and ȳc."
  },
  "open_cell_shear_flux_diagram.png": {
    "suggested_name": "open_cell_shear_flux_diagram",
    "description": "Rectangular open-cell cross-section showing shear flux distribution with four numbered corners (1, 2, 3, 4) and center point c. Shear flux values labeled as q₁', q₂', q₃', q₄' at panel boundaries. Applied torsional moment Ty shown with upward arrow at bottom center. Coordinate system with x-axis horizontal and y-axis vertical marked at center point c. Blue dashed circles at corners I, II, III indicate regions for shear flux analysis. The diagram illustrates the concept that an open-section beam has negligible torsional stiffness, requiring isolation of shear fluxes given by shear forces applied to the section. This is part of the analysis of shear fluxes in thin-walled open sections under combined loading."
  },
  "rectangular_section_shear_flux.png": {
    "suggested_name": "rectangular_section_shear_flux",
    "description": "Rectangular cross-section with dimension a (height) showing shear flux analysis under torsional moment Ty. Four corners numbered 1, 2, 3, 4 with corner 1 at upper left. Coordinate system with x-axis horizontal (rightward) and y-axis vertical (upward) shown at center. Shear flux values q₁', q₂', q₃', q₄' labeled at panel boundaries. Blue dashed circles at corners I, II, III indicate analysis regions. Small inset diagram at top right shows sign convention for shear flux: outward positive, inward negative, with circular arrow indicating q'R = q₁' - q₂'. Equations below show shear flux calculations in terms of Ty, static moments Sx₁, Sx₂, and moment of inertia Jxx. The diagram demonstrates moment equilibrium where shear fluxes are equivalent to the applied torsional moment Ty."
  },
  "shear_flux_torsional_moment.png": {
    "suggested_name": "shear_flux_torsional_moment",
    "description": "Rectangular cross-section showing decomposition of total shear flux into components from shear forces and torsional moment. Four corners with shear flux labels: q₁', q₂', q₃', q₄' (from shear forces in red) and q* (from torsional moment in blue). Applied torsional moment Ty shown with upward arrow at bottom. Center point c marked with coordinate axes. Yellow/orange diagonal lines labeled Ω₁ and Ω₂ indicate enclosed areas for moment calculation. Equation shown: qi = qi' + q* where qi' represents shear flux from shear forces and q* represents constant shear flux from torsional moment. The diagram illustrates the principle that total shear flux is the superposition of contributions from direct shear loading and pure torsion."
  },
  "trapezoidal_section_analysis.png": {
    "suggested_name": "trapezoidal_section_analysis",
    "description": "Trapezoidal cross-section with parallel top and bottom edges, each of length b, and height ba. Top edge has three equally spaced points with area A at corners. Bottom edge has two points with area A at corners, with center point marked for coordinate system origin. Dimensions labeled: b for each top segment, ba for total height. Coordinate system with x-axis horizontal (rightward) and y-axis vertical (upward) at bottom center. Applied loads shown: vertical torsional moment Ty and bending moment Mz at bottom center. Given data: A = 250 mm², a = 50 mm, b = 600 mm, Ty = 3000 N, Mz = 650,000 N·mm. Problem involves finding shear fluxes in this thin-walled section. Centroid location calculated as ȳc = 3a. Inertia values provided: Jxx = 20Aa². Static moments Sx₁ = -3Aa and Sx₃ = Sx₄ = Sx₅ = 2Aa shown for different panels."
  },
  "moment_equilibrium_shear_flux.png": {
    "suggested_name": "moment_equilibrium_shear_flux",
    "description": "Trapezoidal cross-section showing moment equilibrium analysis with shear flux components. Four corners labeled with combined shear fluxes: q₁', q₂', q₃', q₄' (red, from shear forces) and q* (blue, from torsional moment). Center point marked with green circular arrow indicating positive rotation direction. Dashed green lines from center to corners represent moment arms. Equation shown: Mz + Ty·χ̄ = q*·2Ωcell - q₁'·2Ω₁ + q₂'·2Ω₂ + q₃'·2Ω₃ - q₄'·2Ω₄, representing moment equilibrium where moment of external forces equals moment of shear fluxes. Calculation shows Ωcell = (½b·5a)·3 = 15ab/2 and q* = Mz/(2Ωcell) = 1 N/mm. Final shear flux values computed: q₁ = 5 N/mm, q₂ = 7 N/mm, q₃ = 3 N/mm, q₄ = 1 N/mm. Small 3D sketches at right show beam segments with shear flux distributions."
  },
  "cantilever_frame_structure.png": {
    "suggested_name": "cantilever_frame_structure",
    "description": "L-shaped cantilever frame structure with fixed support (hatched) at left end. Horizontal member of length ℓ₂ connected to vertical member of length ℓ₂, with diagonal members of length ℓ₃ extending from the corner. Four nodes labeled A (two at corner, one at top of vertical, one at right end of horizontal). Coordinate system at corner: x-axis horizontal (rightward), y-axis vertical (upward), z-axis along beam length. Vertical downward force F applied at left end. Given data: ℓ₃ = 2000 mm, A = 800 mm², F = 8000 N. Problem asks to find axial stress σzz,4 at position z = ℓ₃/2. Below: rectangular cross-section showing centroid location with coordinates x₀ = ℓ₂/2, y₀ = ℓ₂/2, and moments of inertia Jxx = 4A(ℓ₂/2)² = Aℓ₂², Jyy = 4A(ℓ₂/2)² = Aℓ₂². Internal action diagram shows shear force Ty = -F and bending moment Mx = F(-z) = -Fz. Stress calculation yields σzz,4(ℓ₃/2) = 32 MPa."
  },
  "triangular_section_open_cell.png": {
    "suggested_name": "triangular_section_open_cell",
    "description": "Right triangular cross-section with base b and height c, where b = (√2/2)a and c = 2b = √2·a. Three corners numbered 1, 2, 3 (clockwise from top). Coordinate system with x-axis horizontal (rightward) and y-axis vertical (upward). Applied loads at corner 1: vertical force Ty = (√2/2)F and horizontal force Tx = (√2/2)F. Centroid location: x̄c = a/3, ȳc = a/3. Moments of inertia: Jxx = 2A(c/2)² = 2Ab², Jyy = 2A(b/3)² + A(2b/3)² = (2/3)Ab². Static moments: Sx₁ = -Ab, Sx₂ = 0, Sy₁ = Sy₃ = +Ab/3, Sy₂ = -(2/3)Ab. Blue dashed circles at corners I, II, III indicate regions for open cell flux analysis. Shear flux equations shown for panel boundaries: q₁' = -Ty·Sx₁/Jxx - Tx·Sy₁/Jyy = (√2/2)·FAb/(2Ab²) - (√2/2)·FAb/(2Ab²) = 0, demonstrating the calculation method for open-section shear fluxes."
  },
  "triangular_shear_flux_equilibrium.png": {
    "suggested_name": "triangular_shear_flux_equilibrium",
    "description": "Right triangular cross-section showing shear flux equilibrium and rotation angle calculation. Three corners with shear flux labels: q₁' (red), q* (blue) at each corner. Green circular arrow at corner 2 indicates positive rotation direction. Moment equilibrium equation shown: 0 = q*·2Ωcell with solution q* = 0. Total shear flux q₂ = q₂' - q* = (√2/2)·F/b. Rotation angle calculation: θ' = dθ/dz = 1/(2Ωcell·G)·Σᵢ(qᵢ·ℓᵢ/tᵢ) where ℓᵢ is panel length and tᵢ is thickness. Detailed calculation shows θ' = (2(1+ν))/(Ea²t)·(√2F/2b)·(a/t) with enclosed area Ωcell = ½a². Final result: θ' = (2(1+ν)·F)/(Ea²t) = 1.49×10⁻⁶ rad/mm. Small diagram at bottom left shows cantilever beam with length ℓ and rotation angle θ, with boundary condition θ(0) = 0 (CLAMP) and solution θ(ℓ) = θ'·ℓ = 5.9×10⁻³ rad."
  },
  "right_triangle_section_properties.png": {
    "suggested_name": "right_triangle_section_properties",
    "description": "Right triangular cross-section with base a and height a, hypotenuse labeled 2t. Coordinate system with x-axis horizontal (rightward) and y-axis vertical (upward) at lower left corner. Given data: a = 1600 mm, A = 6000 mm², E = 10⁴ MPa, ν = 0.3. Problem asks to find shear center location. Geometric relationship: b = (√2/2)a. Below: detailed view showing centroid calculation with dimensions (2/3)b and b/3 marked horizontally, 2b marked vertically. Centroid coordinates: x̄c = (2/3)b, ȳc = 0. Note states ySC = 0 for symmetry. Moments of inertia: Jxx = 2Ab², Sx₁ = -Ab, Sx₂ = Ab, Sx₃ = 0. Small diagram at bottom shows triangular section with unknown shear center location xSC marked, and note that Ty = 1 passes through the shear center. Statement indicates rotation of section due to Ty must be zero."
  },
  "triangular_open_cell_flux.png": {
    "suggested_name": "triangular_open_cell_flux",
    "description": "Right triangular cross-section showing open cell shear flux analysis. Three corners numbered 1, 2, 3 with corner 1 at top. Shear flux labels: q₁' (red), q* (blue) at each panel boundary. Blue dashed circles at corners I, II, III indicate analysis regions. Shear flux equations: q₁' = Ty·Sx₂/Jxx = Ab/(2Ab²) = 1/(2b), q₂' = Ty·Sx₁/Jxx = -Ab/(2Ab²) = -1/(2b). Moment equilibrium equation with respect to point 2: Ty·(2b/3 + xSC) = 2Ωcell·q*. Expression for q* derived: q* = (2b/3 + xSC)/(2b²). Rotation angle condition: θ' = dθ/dz = 1/(2Ωcell·G)·(q*·2a/t + q*·2b/(2t) - q₁'·a/t + q₂'·a/t). Imposing θ' = 0 leads to equation relating xSC to geometric parameters. Solution process shown with algebraic manipulation involving terms with √2. Final calculation: xSC = (2ab²)/(b(2a+√2a)) - (2/3)b = (√2/3)a/(a²(√2t+½)) - (√2/3)a = 51.00 mm, marked with asterisks."
  },
  "coordinate_systems_centroid_inertia.png": {
    "suggested_name": "coordinate_systems_centroid_inertia",
    "description": "Educational reference sheet titled \"NOTES ON THE COORDINATE SYSTEMS\" showing rectangular cross-sections with different coordinate system placements. Top section shows centroid calculations for two configurations: (1) coordinate origin at lower left corner with centroid at x̄ = 2Ab/(4A) = 2b, ȳ = 2Aa/(4A) = 2a; (2) coordinate origin at upper right corner with centroid at x̄ = -2Ab/(4A) = -2b, ȳ = -2Aa/(4A) = -2a. Red text emphasizes: \"The position of the centroid does NOT depend on the coordinate system. It is a section property.\" Middle section shows moment of inertia calculations for three coordinate system placements, all yielding Jxx = Aa². Bottom section includes 3D beam sketches showing coordinate axes (x, y, z) and notes: \"Inertias depends on the position of the reference axes, but does NOT depend on its direction.\" Final note states: \"For static moments and fluxes, we must select a surface defined by its normal vector, and keep it!\""
  },
  "static_moments_flux_systems.png": {
    "suggested_name": "static_moments_flux_systems",
    "description": "Reference diagram showing static moment and shear flux sign conventions for outward and inward coordinate systems. Top: two 3D beam sketches showing outward system (x, y, z axes with z outward) and inward system (dashed box, z inward). Middle section shows static moments for rectangular cross-section with dimension a (height) and b (width). For outward system: Sx₁ = A·(-a/2) = -Aa/2, Sy₁ = A·(-b/2) = -Ab/2. For inward system: Sx₁ = A(a/2) = Aa/2, Sy₁ = A(b/2) = Ab/2. Bottom section shows open cell flux conventions. For outward system: rectangular section with shear fluxes q₁', q₂', q₃', q₄' and diagonal line through center labeled z. Note states: \"The fluxes orientation is ARBITRARY and does not depend on z, but we must keep the same normal.\" Three small diagrams show beam segments with Ty applied, comparing outward (q₁' > 0, q₂' > 0) and inward (q₁' < 0, q₂' < 0) conventions. Final section shows closed cell flux with blue circular arrow indicating positive rotation given by normal axis z. Text states: \"OUTWARD → ANTI-CLOCKWISE.\""
  },
  "inward_system_rotation.png": {
    "suggested_name": "inward_system_rotation",
    "description": "Rectangular cross-section showing inward coordinate system convention with z-axis into page. Blue circular arrow at center indicates clockwise rotation direction. Red and blue arrows at corners show shear flux directions. Text annotations: \"INWARD → CLOCKWISE\" and \"The direction of q* is ARBITRARY.\" Below, section titled \"Angle\" states: \"The sign of θ' depends on the normal axis z.\" Final note at bottom emphasizes: \"Concluding, the GOOD PRACTICE is to choose a surface and always keep it.\""
  }
}