{
  "cantilever_beam_distributed_load.png": {
    "suggested_name": "cantilever_beam_distributed_load",
    "description": "Cantilever beam with fixed support at right end (point B) and free left end (point A). Uniform distributed load q(z) = p applied vertically downward along entire beam length. Beam length denoted as ℓ. Coordinate system shows z-axis horizontal (along beam length) with origin at point A, and y-axis vertical pointing upward. Fixed support at B shown with standard hatching symbol indicating clamped boundary condition preventing translation and rotation. This diagram represents the structural setup for displacement method analysis using polynomial approximation, where the problem involves determining vertical displacement v(z) under the uniform load."
  },
  "cantilever_beam_linear_load.png": {
    "suggested_name": "cantilever_beam_linear_load",
    "description": "Cantilever beam with fixed support at left end (point A) and free right end (point B). Linearly varying distributed load q(z) shown as triangular distribution, with maximum intensity at left end decreasing to zero at right end. Load expression given as q(z) = p(-z/ℓ + 1). Beam length ℓ with coordinate system showing z-axis horizontal along beam and origin at left support. Fixed support at A indicated by hatching symbol. Free end at B shown with roller support symbol. Red arrows indicate downward distributed loading varying linearly along span. This setup is for analyzing beam deflection under triangular load distribution using displacement method with trigonometric approximation."
  },
  "trigonometric_shape_functions.png": {
    "suggested_name": "trigonometric_shape_functions",
    "description": "Graph showing multiple trigonometric shape functions φᵢ(z) = sin(iπz/ℓ) plotted over beam length ℓ. Three sinusoidal curves displayed in different colors (blue, yellow/orange, red) representing different mode numbers i = 2, i = 3, and higher modes. Horizontal axis represents position z along beam from 0 to ℓ. Functions oscillate with increasing frequency for higher mode numbers, with i = 2 showing one complete wavelength, i = 3 showing 1.5 wavelengths. These shape functions are used in the trigonometric approximation method for beam displacement analysis, satisfying boundary conditions at beam ends. Curves demonstrate orthogonal basis functions for series expansion of displacement field."
  },
  "inclined_beam_force_rotation.png": {
    "suggested_name": "inclined_beam_force_rotation",
    "description": "Inclined beam member of length ℓ oriented at angle to horizontal, with two local coordinate systems defined. Left end shows fixed support with hatching. Coordinate system 1 (circled) at left end has axes x₁ (horizontal red), y₁ (vertical red), and z₁ (along member, red) with origin at point 0. Coordinate system 2 (circled) at right end has axes x₂ (horizontal red), y₂ (vertical red), and z₂ (perpendicular to member). Vertical force F shown acting downward at right end with upward reaction V indicated. Horizontal dimension ℓ marked below beam. Diagram illustrates rotation of axes problem for analyzing inclined structural member under vertical loading, with annotations indicating \"azione al segno della rotazione\" (action at rotation sign). Problem data includes ℓ = 1000 mm, F = 1000 N, GJ = 10¹⁰ N·mm², EJ = 10¹⁰ N·mm. Setup for polynomial approximation analysis of vertical displacement and rotation using second-order and first-order approximations respectively."
  },
  "two_member_frame_structure.png": {
    "suggested_name": "two_member_frame_structure",
    "description": "Two-member frame structure forming L-shape configuration. Member 1 (horizontal) extends from fixed support at left end (shown with hatching) to pin joint at right end (point circled as 4). Member 2 (vertical) extends downward from pin joint to fixed support at bottom (shown with hatching). Both members labeled with properties ℓ, EJ, GJ, EA indicating length, bending stiffness, torsional stiffness, and axial stiffness. Local coordinate systems shown: y₁-z₁ axes at left support with origin at point 0, and y₂-z₂ axes at bottom support. Inclined force P applied at pin joint at 45° angle shown with dashed red arrow. Coordinate axes y₁ (vertical) and z₁ (horizontal) marked in red at left support. Problem involves compatibility analysis of axial and transversal displacements at pin connection, with displacement fields defined as w₁ = a₀ + a₁·z₁ (axial member 1), w₂ = b₀ + b₁·z₂ (axial member 2), v₁ = c₀ + c₁·z₁ + c₂·z₁² (transversal member 1), v₂ = d₀ + d₁·z₂ + d₂·z₂² (transversal member 2)."
  }
}