{
  "l_shaped_frame_spring_support.png": {
    "suggested_name": "l_shaped_frame_spring_support",
    "description": "L-shaped frame structure with two perpendicular members forming a right angle. The horizontal member (length L, properties EA, EJ) is supported at its left end by a spring with stiffness K and extends horizontally to the right with a horizontal force P applied at the free end. The vertical member (length L, properties EA, EJ) extends upward from the junction point, with a fixed support at its top end indicated by hatching. A rotation angle θ is marked at the top fixed support with a curved arrow showing counterclockwise rotation. The x-axis is indicated pointing to the right. The problem asks to find the rotation θ (in degrees) at x = L/2. Given data: L = 400(1+A/10) mm, EA = 7.2·10⁴ N, EJ = 1.25·10⁶(1+C/10) N·mm², K = 60 N/mm, P = 5000 N. Below the main diagram are two simplified sketches labeled \"Real\" and \"Dummy\" showing the frame configuration with force X and unit force respectively."
  },
  "triangular_truss_pin_joints.png": {
    "suggested_name": "triangular_truss_pin_joints",
    "description": "Isosceles triangular truss with apex at top (point A) and base horizontal at bottom. Base length is h with two equal segments of 2A marked at left and right ends. Height from base to apex is also h. Three members form the triangle: two inclined members from apex to base corners (labeled t₁) and one horizontal base member (labeled t₃). All three corners have pin joints indicated by circular symbols with cross-hatching. Arrows at each joint show the member forces acting away from the joints (tension). Vertical x-axis shown pointing upward on right side. Given data: A = 500 mm², h = 150 mm, t₁ = 1·(1+F/10), t₃ = 2·(1+A/10). Problem asks to find vertical position of shear center measured from x = 0. Solution section shows a coordinate system with y-axis vertical and x-axis horizontal, with dimension d marked, and notes to apply force T = 1000 N at an arbitrary distance d from the reference point. Internal forces q₁, q₂, q₃ and q'₁, q'₂ are labeled on the members."
  },
  "rectangular_section_diagonal_brace.png": {
    "suggested_name": "rectangular_section_diagonal_brace",
    "description": "Rectangular cross-section with width a and height a, showing four corner points labeled A connected by straight edges of thickness t. A diagonal brace of thickness t runs from bottom-left to top-right corner. All four corners have pin joints indicated by circular symbols with internal dots. The section is labeled with dimension a at the bottom and dimension a on the right side. Cross-section A-A is indicated on the right edge. Given data: A = 600 mm², a = 400(1+B/10) mm, t = 1(1+A/10) mm, G = 2.7·10⁴ MPa, GJ_ref = 1·10¹⁰ N·mm². Problem asks to find torsional stiffness GJ/GJ_ref. The solution notes that due to section symmetry, the shear center is in the middle of the section, and therefore shear flow along the oblique panel does not provide torsional resistance. The flow on the four remaining panels is equal."
  },
  "square_section_shear_flow.png": {
    "suggested_name": "square_section_shear_flow",
    "description": "Square thin-walled cross-section with side dimension a (implied from context). Shear flow q is shown with arrows pointing inward on all four sides (top, bottom, left, right), indicating uniform shear flow around the perimeter. At the center, a curved arrow labeled M_t indicates torsional moment in counterclockwise direction. The relationship M_t = 2Ω_c·q is given, where Ω_c = a² is the enclosed area. From this, q = M_t/(2a²). The diagram relates to calculating torsional stiffness, with equations showing GJ = Ga³t and the ratio GJ/GJ_ref = (6a³t)/(GJ_ref) = 172.80."
  },
  "circular_section_torsional_shaft.png": {
    "suggested_name": "circular_section_torsional_shaft",
    "description": "Circular cross-section shaft of length L shown in isometric view. Left end shows circular cross-section with radius R, with four points labeled A around the circumference and wall thickness t marked between points. The cross-section shows multiple A labels and t dimensions indicating thin-walled circular section. The shaft extends to the right with length L marked. At the right end, another circular cross-section is shown with vertical forces P applied upward and downward (creating a couple). Additional force P is shown separately to the left. The left end appears to have a fixed support indicated by hatching marks. Problem asks to evaluate rotation θ (in degrees) at the free end. Given data: A = 500 mm², R = 80 mm, t = 1.2(1+A/10) mm, L = 2500(1+F/10) mm, G = 27000 MPa, P = 7500 N. Solution uses Bredt's formula GJ = G·2πR²t and calculates θ' = M_t/(G·2πR²t) = (2PR)/(G·2πR²t) = P/(GπR²t), leading to θ'L = θ and final result θ = 1.65°."
  },
  "cantilever_beam_distributed_torsion.png": {
    "suggested_name": "cantilever_beam_distributed_torsion",
    "description": "Cantilever beam with fixed support at left end (indicated by hatching and ground symbol) and free at right end. Beam has length L and torsional stiffness GJ. A distributed torsional moment m_t per unit length is applied along the entire beam length, shown by multiple curved arrows indicating counterclockwise torsion when viewed from the right. The x-axis points to the right along the beam axis. Spring with stiffness k is shown at the fixed support. Problem asks to use Ritz method with 1-DOF polynomial approximation to determine torsional moment M_t/M_t_ref at x = L/2. Given data: L = 3700 mm, GJ = 2.2·10⁶ N·mm², k = 1·10⁴(1+D/10) N·mm, m_t = 520(1+A/10) N, M_t_ref = 3·10⁴ N·mm. Solution (A=D=0) uses assumed rotation θ = x·q₁ with θ' = q₁, leading to energy equation and final result M_t/M_t_ref = 1.8."
  },
  "two_span_beam_uniform_load.png": {
    "suggested_name": "two_span_beam_uniform_load",
    "description": "Two-span continuous beam with total length 2L divided into two equal spans of length L each. Left end has pinned support (triangle symbol), middle support at x = L is also pinned (triangle symbol), and right end at x = 2L has pinned support (triangle symbol). Uniform distributed load q acts downward over the entire beam length, shown by vertical arrows pointing downward. Left span has flexural rigidity EJ, right span also has flexural rigidity EJ. Coordinate axis x points to the right. Problem asks to use Ritz method with 1-DOF trigonometric approximation to determine vertical displacement at x = L/2. Given data: L = 300(1+B/10) mm, EJ = 1.25·10⁶ N·mm², q = 0.2 N/mm. Solution (B=0) uses displacement functions w₁ = sin(πx₁/L)q₁ for left span and w₂ = sin(πx₂/2L)q₂ for right span, with compatibility conditions w₁(L) = w₂(0) (identically satisfied) and w₁/x(L) = w₂/x(0) (to be imposed). Final expressions: w₁ = sin(πx₁/L)q₁ and w₂ = -2sin(πx₂/2L)q₁."
  }
}