{
  "cantilever_beam_vertical_force.png": {
    "suggested_name": "cantilever_beam_vertical_force",
    "description": "Cantilever beam with fixed support at top end (indicated by hatching) and free end at bottom. The beam has total length 3ℓ, with a vertical downward point force F applied at distance 2ℓ from the fixed support (at distance ℓ from the free end). Point B is marked at the free end. A right-handed coordinate system is shown at bottom left with x-axis horizontal (rightward), y-axis vertical (upward), and z-axis out of page. The diagram is used to compute the y-component of the reaction force at point B. Given data: ℓ = 400 mm, EA = 9.2×10⁷ N, F = 5000 N. The problem involves calculating reaction forces using stiffness relationships k₁ = EA/ℓ and k₂ = EA/(2ℓ)."
  },
  "simply_supported_beam_point_load.png": {
    "suggested_name": "simply_supported_beam_point_load",
    "description": "Simply supported beam with pinned supports at both ends (indicated by hatching symbols). Total beam length is 4ℓ, divided into three segments: ℓ, 2ℓ, and ℓ. Point A is located at distance ℓ from the left support. A vertical downward point force F is applied at the center of the beam (at distance 2ℓ from left support). Reaction forces are shown at both supports with upward arrows. The diagram includes moment M and reaction force notations. Given data: ℓ = 1600 mm, F = 2500 N, EI_yy = 6×10¹⁰ N·mm². The problem involves computing the reaction at point A using symmetric structure and load conditions, with moment equations M_y = M₁ for 0 ≤ x ≤ ℓ and M_y = M₁ + F(x + ℓ) for ℓ ≤ x ≤ 2ℓ."
  },
  "semi_monocoque_truss_structure_3d.png": {
    "suggested_name": "semi_monocoque_truss_structure_3d",
    "description": "Three-dimensional isometric view of a semi-monocoque beam structure showing two cross-sectional frames connected by longitudinal members. The structure extends length ℓ in the longitudinal direction. Each cross-section is square with dimension a × a, containing diagonal bracing members forming an X-pattern. Four corner nodes are labeled: nodes ① and ② at the front cross-section, nodes ③ and ④ at the rear cross-section. The front left cross-section is labeled with circled numbers at corners and shows internal diagonal members with dimension t (thickness). Point ① at the front-left corner is marked as the loading point where concentrated forces F_x = 5000 N (horizontal) and F_y = 1000 N (vertical) are applied. The rear cross-section is fixed (indicated by hatching). A right-handed coordinate system is shown at bottom left with x-axis rightward, y-axis upward, and z-axis into the page. Vertical dimension a is marked on the left side, and horizontal dimension a is marked at the bottom. Given data: ℓ = 4000 mm, F_x = 5000 N, F_y = 1000 N, A = 1000 mm², a = 200 mm, t = 1 mm, E = 72000 MPa, ν = 0.3. The problem asks to compute the axial stress σ_zz of stringer ③ at distance ℓ/2 from the clamp."
  },
  "diagonal_member_force_decomposition.png": {
    "suggested_name": "diagonal_member_force_decomposition",
    "description": "Square frame cross-section showing force decomposition of a diagonal member. The square frame has four corners with a diagonal member running from lower-left to upper-right, labeled with dimension d. The diagonal is oriented at angle relative to horizontal. Force vectors are shown: F_y (horizontal, pointing right), F_n (vertical, pointing upward), and F_y' (along diagonal, pointing upper-right). A small reference diagram in the upper-left shows the orientation labeled \"2-4'\". The diagonal length d is expressed as d = a/√2 where a is the side length of the square. Equations show force component transformations: F_x' = -F_x/√2 + F_y/√2 and F_y' = (F_x + F_y)/√2. Additional calculations show the second moment of area Ī_yy = 2A(a/√2)² = Aa² and stress calculation σ_zz = M_y'/Ī_yy'(-d) = (-F_x + F_y)/(4A) · ℓ/a = -20 MPa. This diagram illustrates the geometric relationships and force transformations for analyzing diagonal members in the truss structure."
  },
  "three_cell_symmetric_truss_section.png": {
    "suggested_name": "three_cell_symmetric_truss_section",
    "description": "Symmetric three-cell semi-monocoque truss cross-section showing a triangular configuration. The structure has width a (horizontal base) and height ℓ (vertical). Three corner nodes at the base are labeled A (left and right corners) with a center vertical member labeled t. The top apex is labeled with \"t A\" indicating a stringer of area A. Internal diagonal members connect the apex to the base corners, labeled with t on the left and right sides. A vertical dashed line shows the axis of symmetry through the center. Dimension labels show t for member thicknesses and a for the base width. A vertical force F is applied upward at the center of the base. A curved double-headed arrow labeled φ indicates rotation about the longitudinal axis. Given data: A = 2000 mm², a = 200 mm, h = 100 mm, ℓ = 100 mm, F = 5000 N, t = 1 mm. Below the main diagram are two additional sketches showing shear flow distribution patterns in the three cells, with arrows indicating flow directions and numerical values. The problem asks to compute the flux q (shear flow) in the structure."
  },
  "beam_linearly_varying_distributed_load.png": {
    "suggested_name": "beam_linearly_varying_distributed_load",
    "description": "Beam with pinned supports at both ends (indicated by circle symbols at left and right) subjected to a linearly varying distributed load. The beam has length ℓ. The distributed load varies linearly from zero at the left end to maximum intensity μ at the right end, shown by vertical arrows of increasing length. The load distribution forms a triangular pattern along the beam length. Given data: ℓ = 3000 mm, μ = 4 N/mm, EI_xx = 6×10¹¹ N·mm². The problem requests a displacement-based approach using the simplest possible polynomial approximation to estimate the vertical displacement in the middle of the beam. The displacement function is given as v = k·z²(z - ℓ) where k = μ/(ℓ)·z. This represents a cubic polynomial approximation for the deflection curve satisfying boundary conditions at the pinned supports."
  },
  "mohrs_circle_stress_state.png": {
    "suggested_name": "mohrs_circle_stress_state",
    "description": "Mohr's circle diagram for stress state analysis showing a circle in the x-y plane (normal stress vs. shear stress). The horizontal axis represents normal stress x (in mm units) and the vertical axis represents shear stress y (in mm units). The circle passes through two points labeled A: one at coordinates (approximately 0, 100) and another at (approximately 0, -100). A third point A is marked on the circle at coordinates (approximately 100, 100). The center of the circle is at the origin. Dashed lines connect the center to the points A, with dimension t marked along these radial lines. Below the Mohr's circle is a small force diagram showing force F applied horizontally at distance d from a point, with angles q₁ and q₂ marked. The relationship q₁ = q₂ = F/200 is given. Given data: t = 1 mm, A = 100 mm, E = 72000 MPa, ν = 0.3. The problem involves computing the x-position of the shear center for an open semi-monocoque cross-section, with the moment equation M(d) = F·d = 0 leading to d = 0 mm."
  }
}