{
  "page_1_img_1.png": {
    "suggested_name": "frame_structure_fixed_pinned_supports",
    "description": "Frame structure with four labeled points (A, B, C, D) forming a rectangular configuration with an inclined member. Point A has a fixed support (left side) indicated by hatching and restraint symbols. Point B is at the upper right corner of the horizontal member. Point C is at the lower right corner where a vertical member connects. Point D has a roller support (right side) shown with hatching at an inclined orientation. The diagram includes a coordinate system with x, y, and z axes shown at bottom left. Member F is labeled on the right inclined section."
  },
  "page_1_img_2.png": {
    "suggested_name": "column_axial_force_diagram",
    "description": "Vertical column with fixed supports at top and bottom, indicated by hatching and pinned connection symbols. Downward force F applied at the top. The column shows internal force distribution with Roman numerals I and II marking different segments. Upward and downward arrows indicate axial forces along the length. Dimension ℓ marks the total height. Coordinate system at bottom shows z-axis vertical, y-axis horizontal, and x-axis into the page. Lower portion shows a pinned support with coordinate axes."
  },
  "page_2_img_1.png": {
    "suggested_name": "rectangular_frame_four_corners",
    "description": "Rectangular frame structure with four corner points labeled A₁, A₂ (bottom corners) and A₁, A₂ (top corners, with subscript notation). All corners shown as pinned joints (filled circles). Horizontal dimension labeled as t between vertical members and ℓ₂ for top span. Vertical dimension labeled as t for each side, with total height ℓ₁ marked on right side. Coordinate system shows y-axis vertical and x-axis horizontal at bottom left."
  },
  "page_2_img_2.png": {
    "suggested_name": "triangular_truss_three_members",
    "description": "Triangular truss structure with three members meeting at apex. Left member labeled with length ℓ and point A with circled number (3). Bottom horizontal member has two points: left point A with circled (1) and right point A with circled (2). Right side shows distributed load pattern indicated by horizontal arrows of varying lengths. Bottom shows dimension ℓ with double-headed arrow. Members labeled as η (left diagonal), J (center/apex region), and numbered sections 1, 2, 3 on right side. Fixed support symbol shown at bottom left."
  },
  "page_3_img_1.png": {
    "suggested_name": "bent_frame_point_load",
    "description": "L-shaped or bent frame structure with fixed support at left end (indicated by hatching). Horizontal member of length ℓ extends to the right, then bends upward at an angle. Point force F applied downward at the bend location. The inclined member has length ℓ extending upward and to the right. Coordinate system shows y-axis vertical, x-axis horizontal, and z-axis at the fixed support. Double-headed arrow at bottom indicates the horizontal span dimension ℓ."
  },
  "page_3_img_2.png": {
    "suggested_name": "arch_parabolic_distributed_load",
    "description": "Parabolic arch structure with pinned supports at both ends (shown as filled circles). Distributed upward load shown by vertical arrows along the arch length, with varying arrow heights suggesting non-uniform distribution. Load function given as ℓ(x) = -4x² + 4x. Support reactions labeled as μ₁ (left) and μ₂ (right) shown as upward arrows below the arch. Horizontal x-axis shown at bottom with origin at 0 and point 1 marked. The arch spans horizontally with symmetric parabolic profile."
  }
}