{
  "l_shaped_frame_fixed_pin_supports.png": {
    "suggested_name": "l_shaped_frame_fixed_pin_supports",
    "description": "L-shaped frame structure with horizontal and vertical members forming a right angle. Fixed support (hatched symbol) at left end of horizontal member, pinned support (triangle symbol) at bottom end of vertical member. Horizontal member extends total length L, divided into two segments of L/2 each. Vertical member has length L extending downward. Vertical upward force P applied at the junction between horizontal and vertical members. Horizontal member divided into two sections: left section labeled EA₁ and EJ, right section labeled EA₂ and EJ. Vertical member labeled EA₃ and EJ. Distributed load shown as hatched pattern on right portion of horizontal member. Coordinate system shows x-axis pointing right. Problem asks to determine axial force at x = L/2. Given data includes L = 1200(1+D/10) mm, EA₁ = 2.0·10⁴ N, EA₂ = 1.0·10⁴ N, EA₃ = 2.9·10⁴ N, EJ = 1.5·10¹⁰ N·mm², P = 1200(1+F/10) N."
  },
  "three_rib_arch_panel_structure.png": {
    "suggested_name": "three_rib_arch_panel_structure",
    "description": "Three-dimensional arch structure with three parallel ribs (Rib #1, Rib #2, Rib #3) supporting a curved panel. Front view shows two arch ribs with semicircular profiles spanning horizontal distance b, with rise height h. Four corner points labeled A with pinned supports at base. Panel thickness labeled as t₁ and t₂, where t₂ represents panel thickness at specific location. Distributed load q_x shown as hatched arrows on top surface of panel. Ribs spaced at intervals of length L in longitudinal direction. Coordinate system shows x-axis along base. Cross-sectional elements labeled with thickness t at various locations. Problem asks to evaluate shear flow in panel with thickness t₂ at x = 0. Given data: A = 700 mm², b = 600 mm, h = 150 mm, t₁ = 1 mm, t₂ = 1.5 mm, L = 1800(1+A/10) mm, p = 2.5·10⁻²(1+B/10) N/mm²."
  },
  "cantilever_beam_rigid_link.png": {
    "suggested_name": "cantilever_beam_rigid_link",
    "description": "Cantilever beam with fixed support (hatched symbol) at left end and rigid link at right end. Beam has length L with variable properties EJ(x) and EA(x) along its length. Rigid link extends vertically downward from right end by distance d. Horizontal force P applied at bottom of rigid link, pointing left. Coordinate system shows x-axis pointing right along beam length. Problem uses Ritz method with 1-dof polynomial approximation to determine strain energy. Given data: L = 1200 mm, d = 45 mm, EA₀ = 1.15·10⁶ N, EA₁ = 6.5·10⁵(1+B/10) N, EJ₀ = 1.5·10⁹ N·mm², EJ₁ = 7.5·10⁹ N·mm², P = 600 N. Note indicates EA and EJ vary linearly with x from EA₀/EJ₀ to EA₁/EJ₁."
  },
  "rectangular_frame_two_ribs.png": {
    "suggested_name": "rectangular_frame_two_ribs",
    "description": "Three-dimensional rectangular frame structure with two parallel ribs (Rib #1 and Rib #2) supporting an inclined panel. Front view shows rectangular frame with width a and height b, with four corner pinned supports. Panel thickness labeled as t at multiple locations. Cross-sectional area A marked at corner joints. Two vertical upward forces P applied at top corners of frame. Ribs extend longitudinally with spacing L. Coordinate system shows x-axis horizontal. Hatched region at top right indicates fixed boundary condition. Problem asks to model Rib #2 as a beam and evaluate bending moment at x = a/3. Given data: a = 500(1+A/10) mm, b = 250 mm, t = 0.6 mm, A = 500 mm², L = 2000 mm, P = 1000 N. Solution section shows equilibrating shear flow diagrams with values ¼P_b, ¾P_b, and ¼P distributed along frame members."
  },
  "two_segment_frame_inclined.png": {
    "suggested_name": "two_segment_frame_inclined",
    "description": "Two-segment frame structure consisting of horizontal member and inclined member meeting at a joint. Horizontal member has length L₁ on each side of joint (total span 2L₁), with properties EJ₁ and GJ₁. Inclined member extends upward at an angle with length L₂ and properties EJ₂ and GJ₂ (unknown). Vertical upward force P applied at left end, vertical downward force P applied at joint, and reaction force S (upward) at left end. Fixed support (hatched symbol) shown at top of inclined member. Problem asks to find ratio GJ₂/GJ₁ such that S = S_max. Given data: L₁ = 300 mm, L₂ = 750 mm, EJ₁ = 2·10⁹ N·mm², EJ₂ = 3·10⁹ N·mm², GJ₁ = 9·10⁷ N·mm², P = 1200 N, S_max = 15(1+F/10). Two coordinate system diagrams shown below: \"Real\" system with local axes (y₁, z₁) and (y₂, z₂) for each member, and \"Dummy\" system with unit load configuration."
  },
  "cylindrical_tube_circular_cross_section.png": {
    "suggested_name": "cylindrical_tube_circular_cross_section",
    "description": "Cylindrical tube with circular cross-section showing left end view and longitudinal perspective. Circular cross-section has diameter 2R with four points labeled A positioned at cardinal locations (top, bottom, left, right) around circumference. Wall thickness t marked between adjacent A points. Tube extends longitudinally with length L, shown with fixed support (hatched symbol) at right end. Vertical upward force P applied at top point A on left end. Coordinate system shows S-axis vertical. Problem asks to evaluate contribution of shear deformability to displacement S. Given data: L = 2300 mm, R = 150 mm, t = 0.8(1+A/10) mm, P = 1700(1+B/10) N, G = 27000 MPa. Solution shows cross-sectional area A* = (g·t·R)/π and shear displacement S_shear = PL/(GA*) = 0.4739 mm."
  }
}