{
  "cantilever_beam_fixed_roller_point_load.png": {
    "suggested_name": "cantilever_beam_fixed_roller_point_load",
    "description": "Structural beam diagram showing a hyperstatic beam system with total length 3ℓ divided into two segments: left segment of length 2ℓ and right segment of length ℓ. The beam has a fixed support (preventing translation and rotation) at the left end labeled point B, and a roller support (preventing vertical translation, allowing horizontal movement and rotation) at point A located at distance 2ℓ from the left end. A vertical downward point load F is applied at the free right end of the beam. The diagram shows three constraints (noted as \"3 constraints\") with annotations indicating constraint locations. Dimension labels show the beam segments as \"2ℓ\" and \"ℓ\" measured along the horizontal axis. Given data: ℓ = 4000 mm, F = 6000 N, E = 200 GPa (200,000 MPa), Ixx = 500,000 mm⁴. The problem involves finding reaction forces at point A using the displacement method, as this is a hyperstatic system (3 rigid DOF < 4 constraints)."
  },
  "beam_free_body_diagram_reactions.png": {
    "suggested_name": "beam_free_body_diagram_reactions",
    "description": "Free body diagram showing internal actions analysis for a beam with reaction forces and moments. The beam spans horizontally with moment RMxB at left end, vertical reaction RYB at left support (point B labeled with circled 2), vertical reaction RYA at interior point A (labeled with circled 1), and vertical force F at right end. The diagram illustrates the beam divided into segments for internal force analysis. Coordinate system shows y-axis vertical (upward positive) and x-axis horizontal (rightward positive). The beam is shown with reaction moment RMxB (counterclockwise), vertical reactions RYB and RYA (upward), and applied force F (downward). Dimension markers indicate positions along the beam length. This represents the \"Internal Actions\" analysis step where the beam is cut to determine internal forces and moments at specific cross-sections."
  },
  "cantilever_beam_distributed_load.png": {
    "suggested_name": "cantilever_beam_distributed_load",
    "description": "Structural beam diagram (Problem 2) showing a beam with total length 3ℓ divided into segments 2ℓ and ℓ. The beam has a fixed support at left end (point B) preventing all translation and rotation, and a roller support at point A (at distance 2ℓ from left end) preventing vertical translation. A uniformly distributed load p is applied over the right segment of length ℓ, shown as downward arrows along the top of the beam. Point C marks the right free end of the beam. Dimension labels show \"2ℓ\" for the left segment and \"ℓ\" for the right segment measured horizontally. Given data: ℓ = 4000 mm, p = 1 N/mm (distributed load intensity), E = 200,000 MPa, Ixx = 500,000 mm⁴. The problem is hyperstatic with 4 constraints and 3 degrees of freedom, requiring analysis to find reaction forces at point A. Annotations indicate points 1 (at A) and 2 (at B) for the analysis."
  },
  "beam_internal_forces_distributed_load.png": {
    "suggested_name": "beam_internal_forces_distributed_load",
    "description": "Free body diagram showing internal forces and moments at a beam cross-section for the REAL system analysis (labeled as section 2). The diagram depicts a beam segment with length dimensions z₂ (left portion) and ℓ (right portion) marked above. At the left end (point labeled with circled C), internal moment Mx2 (counterclockwise) and vertical shear force Ty2 (upward) are shown. At the cut section, internal forces are illustrated with moment Mx2, shear y2 (in red), and axial force z2 (in red). A uniformly distributed load p acts downward over the right segment of length ℓ, shown as vertical arrows. Vertical reaction force RYA acts upward at point A. Point C is marked at the right end. The diagram includes equilibrium equations: Ty2 = -RYA - p(ℓ + z2) and Mx2 = -RYA·z2 - (1/2)p(ℓ + z2)². This represents the internal actions analysis for a beam section subjected to distributed loading, used in the Principle of Virtual Work (PCVW) calculations shown in the surrounding context."
  },
  "cantilever_beam_slider_constraint.png": {
    "suggested_name": "cantilever_beam_slider_constraint",
    "description": "Structural beam diagram (Problem 3) showing a beam with total length 2ℓ divided into two equal segments of length ℓ each. The beam has a fixed support at the left end (point B) preventing all translation and rotation. At the right end (point A), there is a slider constraint that permits y-translation (vertical movement) and x-rotation but prevents x-translation (horizontal movement), indicated by a triangular slider symbol on a horizontal surface. A vertical downward point load F is applied at an intermediate location between the two segments. Dimension labels show \"ℓ\" for each segment measured horizontally along the beam axis. Given data: F = 6000 N, E = 200 GPa, Ixx = 500,000 mm⁴. The problem is hyperstatic with 3 DOF < 5 constraints, requiring two virtual systems for analysis. Annotations indicate the slider constraint characteristics (permits y-translation and x-rotation) and notes that all reaction forces (RF) at point A need to be found. The coordinate system shows y-axis vertical and x-axis horizontal."
  }
}