{
  "cantilever_beam_spring_support.png": {
    "suggested_name": "cantilever_beam_spring_support",
    "description": "Vertical cantilever beam with fixed support at top (left end shown with hatching) and pinned support at bottom (right end shown with ground symbol). Spring element with stiffness k positioned horizontally near the top of the beam. Vertical downward point load F applied at distance ℓ from the top. Coordinate system shows x-axis pointing upward (vertical) and y-axis pointing rightward (horizontal). The beam has length ℓ and properties EA (axial rigidity) and EJ (flexural rigidity). Given data: EA = 4·10⁸ N, EJ = 1·10¹² Nmm², ℓ = 3000 mm, k = 500 N/mm. Problem involves finding critical load using polynomial approximation with geometric and linear strain formulations."
  },
  "beam_two_springs_point_load.png": {
    "suggested_name": "beam_two_springs_point_load",
    "description": "Vertical beam system with two spring supports and applied loading. Fixed support at top left with spring k₂ attached horizontally. At mid-span (distance ℓ₁ from top), there is a vertical spring k₁ connecting to a point where vertical downward force F is applied. The beam continues downward for length ℓ with properties EA (axial rigidity) and EJ (flexural rigidity), terminating at a pinned support at bottom. Coordinate system shows y₁ pointing upward and x₁ pointing rightward at bottom support. Displacement variables labeled: z₁ (vertical at top spring), w₂ (horizontal at top spring), w₃ (horizontal at mid-span spring), and u₁ (vertical at bottom). Given data: ℓ = 2000 mm, EA = 6·10¹⁰ N, EJ = 12·10¹⁰ Nmm², k₂ = 1 N/mm, k₁ = 1·10³ N/mm, ℓ₁ = 1000 mm. Problem involves finding critical load using polynomial approximation with internal work formulation for beam with nonlinear geometric strain and infinitesimal displacement in y-direction."
  },
  "free_body_diagram_beam_spring.png": {
    "suggested_name": "free_body_diagram_beam_spring",
    "description": "Free body diagram of horizontal beam segment with fixed support at left end (shown with hatching), spring support k₁ in middle, and pinned support at right end. Beam has axial rigidity EA labeled along its length. Vertical downward force F shown with arrow at left end. Spring k₁ shown with vertical displacement w₁(ℓ) indicated by downward arrow. Equilibrium equation shown: F + (EA/ℓ)·w₁⁺(ℓ) + k₁w₁⁻(ℓ) = 0. Solution expression for displacement at spring location: w₁(ℓ) = -F/(EA+k₁ℓ)·ℓ = a_w·ℓ. Diagram drawn in magenta/pink color to distinguish it as a free body diagram for analysis purposes."
  },
  "frame_structure_springs_segments.png": {
    "suggested_name": "frame_structure_springs_segments",
    "description": "L-shaped frame structure with vertical and horizontal members connected at right angle. Top left shows fixed support with spring k₂ attached horizontally. Vertical member has length ℓ/₂ₐ at top, spring k₁ positioned mid-height, then vertical force F applied downward, followed by another segment of length ℓ/₁ₐ. Horizontal member at bottom has length ℓ/₂ with pinned support at left end (shown with ground hatching). Coordinate system at bottom right shows Δz pointing upward and w pointing rightward, with N↑ indicating normal force direction. Displacement variables labeled: v₁ (horizontal at top), a₁ (rotation at top), z₁ (vertical at top spring location), w (horizontal at bottom right), and Δz (vertical at bottom right). Given data: ℓ = 4000 mm, GA = 1·10¹⁰ N, EJ = 12·10⁸ Nmm², EA = 1·10¹⁰ N, k₁ = 1.5·10³ N/mm, k₂ = 2500 N/mm. Problem involves finding critical load using polynomial approximation with linear and quadratic displacement functions for different segments."
  },
  "frame_distributed_load_deformation.png": {
    "suggested_name": "frame_distributed_load_deformation",
    "description": "Two diagrams showing rectangular frame structure before and after deformation. Top diagram shows undeformed rectangular frame with width b (horizontal) and height a (vertical). Frame has pinned supports at all four corners (shown as black dots) and one additional support at mid-span of top beam. Point A marked with green dot at center of top beam. Triangular distributed load p applied along top edge, varying linearly from zero at left to maximum at right (shown with vertical hatching). Bottom diagram shows deformed shape with parabolic curved top member, vertical dimension labeled as 1, and horizontal coordinate η ranging from 0 to η. Given data: a = 2 mm, b = 3 mm, p = 10 N/mm. Problem involves finding virtual work of force for unitary virtual displacement of point A in vertical direction using parabolic element approximation. Deformed shape expressions provided: N(η) = (-4η²/b² + 1)δₐ and p(η) = (p/b)·η + p/2."
  },
  "continuous_beam_four_supports.png": {
    "suggested_name": "continuous_beam_four_supports",
    "description": "Continuous beam with four equally-spaced pinned supports spanning total length 4ℓ. Supports located at positions 0, ℓ, 2ℓ, 3ℓ, and 4ℓ from left end, each shown with triangular support symbol and ground hatching. Vertical upward point load F applied at position 7ℓ/2 (between third and fourth supports). Two moment reactions labeled: θ (rotation) at leftmost support with curved arrow, and H (moment) at second support with curved arrow. Coordinate system shows y-axis pointing upward and z-axis pointing rightward at left end. Dimension ℓ/2 marked between third support and load application point. Given data: ℓ = 1000 mm, EJ = 6·10⁶ Nmm², H = 4·10⁵ Nmm, F = 2000 N. Problem involves finding rotation θ using trigonometric approximation with one term, using solution form N(z) = C·sin(πz/ℓ)."
  }
}