{
  "riveted_connection_thin_plates.png": {
    "suggested_name": "riveted_connection_thin_plates",
    "description": "Riveted connection between three thin rectangular plates showing front elevation view. Two outer plates (labeled A₁ and A₂) sandwich a middle plate (labeled A₃) connected by rivets arranged in two vertical lines. Vertical force F applied at top of upper plate (A₁) with coordinate system showing y-axis vertical. Dimension b indicates vertical spacing between rivet lines, dimension a indicates horizontal width. Rivet #1 circled in blue at lower left position. Annotation indicates \"x lines of rivets\" and \"thin panels\" with arrows. Problem involves finding shear stress in rivet #1. Given data: J_xx = 1.5 × 10⁴ N·mm, A₁ = A₂ = A = 5000 mm², A₃ = 3500 mm², P = 100 mm, φ = 7 mm (rivet diameter), a = 500 mm, b = 240 mm, F = 1000 N."
  },
  "clamped_beam_assembly_3d.png": {
    "suggested_name": "clamped_beam_assembly_3d",
    "description": "Three-dimensional isometric view of a rectangular box beam assembly with clamped (fixed) support at right end shown with hatching. Beam has rectangular cross-section with dimensions a (width) and b (height), extending length ℓ. Cross-hatched region at mid-span indicates a specific cross-section of interest. Four corner stringers labeled A₁ (bottom corners) and A₂ (top corners) with thickness annotations t₁, t₂, and t₃ for different panel thicknesses. Vertical force F applied at bottom left corner. Distributed pressures p₁ and p₂ shown acting on front face with red arrows. Coordinate system shows x, y, z axes. Blue arrows labeled ℓ/2 indicate half-length dimension. Problem asks to find shear flux q_i and normal stress σ_zz at ℓ/2 from the clamp, and to plot internal actions in the rib. Given data: ℓ = 1500 mm, a = 400 mm, b = 250 mm, t₁ = 1 mm, t₂ = 2 mm, t₃ = 1.5 mm, A₁ = 2000 mm², A₂ = 4000 mm², F = 10 kN, p₁ = 90 N/mm, p₂ = 300 N/mm."
  },
  "rectangular_cross_section_properties.png": {
    "suggested_name": "rectangular_cross_section_properties",
    "description": "Rectangular cross-section diagram showing section properties calculation. Rectangle with width a and height b, with four corners labeled A₁ (bottom corners) and A₂ (top corners), numbered 1-4 counterclockwise from bottom left. Coordinate system with origin at bottom left corner, x-axis horizontal (right), y-axis vertical (up). Centroid marked with red dot and arrows showing x̄ and ȳ coordinates. Equations shown for centroid location: ȳ_c = (2A₂b)/(2A₁ + 2A₂) = (4/3)b. Second moment of area: J_xx = 2A₂(2/3 b)² + 2A₁(-1/3 b)² = (4/3)A₂b². First moment of area: S_x1 = S_x2 = -A₁·(b/3) = -(2/3)A₂b, and S_x3 = S_x4 = (2/3)A₂."
  },
  "beam_internal_actions_distributed_load.png": {
    "suggested_name": "beam_internal_actions_distributed_load",
    "description": "Beam segment diagram showing internal actions at two cross-sections labeled ① and ②. Left end has fixed support (hatched). Beam divided into two segments of length ℓ each. Distributed load indicated between sections with annotation \"dist. load with MAX = P2\". At section ②: shear force T_yP2 and bending moment M_2P2 shown with red arrows. At section ①: shear force T_yP1 and moment M_2P1. Free body diagrams shown for sections ① and ② with internal forces and moments labeled (T_y1, M_x1, M_2L, T_yP, M_2P, M_2PL, T_yPL, M_2F, H_2F, H_2PL). Coordinate system shows x₁, y₁, z₁ axes at section ①, and x₂, y₂, z₂ at section ②. Equilibrium equations provided: T_y1 = -T_yP - T_yP1, M_x1 = -(T_yP + T_yP1)·e_z, M_2L = M_2P + M_2PL for section ①, and similar equations for section ②."
  },
  "rib_equilibrium_shear_flux.png": {
    "suggested_name": "rib_equilibrium_shear_flux",
    "description": "Rib equilibrium diagram showing internal actions at a rib location. Top view shows beam with fixed support (hatched) at left, sections labeled ② and ①, with \"RIB\" marked at junction. Below shows detailed rib free body diagram with shear fluxes q₂₂ and q₂₁ entering from left and right (sections ② and ①), and shear flux jump q₂R shown in red diagonal arrow across the rib. Horizontal arrows indicate shear flux continuity. Triangular distributed load p₂ shown acting on rib with resultant q₂R. Small rectangular element labeled \"rib\" shows equilibrium of forces. Annotations state: \"the rib equilibrates: the external force P2, the shear fluxes jump in the panel\" and \"the rib must be in equilibrium\". Equations shown: q₂₂ = q₂₁ and q₂R = q₂₂ - q₂₁. Small inset diagram shows rectangular cross-section with corners labeled 1, 2, 3, 4."
  },
  "rib_distributed_bending_moment.png": {
    "suggested_name": "rib_distributed_bending_moment",
    "description": "Rib analysis diagram showing distributed bending moment from shear flux discontinuity. Top left shows rectangular rib cross-section with height b, width a, and shear fluxes q₄R, q₃R, q₂R, q₁R on four sides. Triangular distributed load p₂ shown above. Annotation states \"TBN: q₂R = q₃R = q*\". Right side shows distributed moment representation: q₄R·b and q₃R·b acting as line loads with variable m (bending moment per unit length) shown with red arrows. Equation for distributed bending moment: m = 2q₂R·Ω + 2q₄R·Ω = 2(q₂R + q₄R)·(½·b/2·dη) where Ω is area of triangle. With dη = 1, m equals bending moment per unit length given by q₂R and q₄R. Small \"CUT\" diagram shows differential element dη with q₄R forces. Bottom shows rib free body with external loads: shear T, moment M, distributed load (η/a)·p₂, and internal shear fluxes. Equations provided for shear T and moment M including external load contribution and integral of distributed moment."
  },
  "square_hollow_section_beam_3d.png": {
    "suggested_name": "square_hollow_section_beam_3d",
    "description": "Three-dimensional isometric view of square hollow section beam with clamped (fixed) support at right end shown with hatching. Beam has square cross-section with width w on each side, extending length ℓ. Four corner stringers labeled A₁ (red, diagonal corners) and A₂ (blue, other diagonal corners). Central stringer A₁ circled in red at center. Vertical downward force F applied at bottom front corner. Coordinate system not explicitly shown. Inset shows cross-section view rotated 45° with centroid marked and dimension t_i indicated. Problem involves finding σ_zz at ℓ/2 and shear stress in rivets. Given data: A₁ = 300 mm² = 2A, A₂ = 150 mm² = A, t = 1.5 mm for all panels, w = 100 mm, E = 72000 MPa, ν = 0.3, ℓ = 1500 mm, d₁ = 2 mm (p₁ = 10 mm), d₂ = 3 mm (p₂ = 12 mm), F = 15 kN. Section properties calculated assuming rotation makes section symmetric with respect to x and y axes: J_xx = 2A₁(√2/2 w)² = A₁w² = 2Aw², J_yy = 2A₂(√2/2 w)² = A₂w² = Aw². First moments: S_x1 = -S_x3 = -A₁·√2/2 w = -√2Aw, S_x2 = S_x4 = 0, S_y1 = S_y3 = 0, S_y2 = -S_y4 = A₂·√2/2 w = √2/2 Aw."
  },
  "diamond_cross_section_open_cell.png": {
    "suggested_name": "diamond_cross_section_open_cell",
    "description": "Diamond-shaped (square rotated 45°) cross-section diagram for open cell shear flux analysis. Four corners labeled 1, 2, 3, 4 (counterclockwise from bottom) with corresponding shear fluxes q₁, q₂, q₃, q₄. Superscripts indicate open cell (q') and closed cell (q*) contributions shown in red and blue. Coordinate system with y-axis vertical, x-axis horizontal. Applied forces F_x (horizontal right) and F_y (vertical up) shown at right side. Positive torque direction (⊕+) indicated at center. Equations for open cell shear fluxes: q₁' = -F_y(S_x1/J_xx) - F_x(S_y1/J_yy), q₂' = -F_y(S_x2 + S_x2)/J_xx - F_y(S_y2 + S_y2)/J_yy, q₃' = -F_y(S_x4/J_xx) - F_x(S_y4/J_yy). Moment equilibrium equation (circled ②): LHS = 0, RHS = 2q*w² - 2q₃'(w²/2), giving q* = q₃'/2 = (1/2)(F_x·√2w/2) = (√2F_x)/4. Closed cell total fluxes: q₁ = q₁' + q*, q₂ = q₂' + q*, q₃ = q₃' - q*, q₄ = -q*."
  },
  "rectangular_box_beam_3d.png": {
    "suggested_name": "rectangular_box_beam_3d",
    "description": "Three-dimensional isometric view of rectangular box beam with clamped (fixed) support at top right shown with hatching. Beam has rectangular cross-section with width a and height b, extending length 2ℓ. Front face (red rectangle) shows cross-section at analysis location. Coordinate system with origin at bottom left front corner: x-axis horizontal right, y-axis vertical up, z-axis along beam length. Vertical force P applied at bottom left front corner pointing up. Blue labels η and ξ indicate local coordinates on cross-section. Dashed lines show hidden edges. Problem asks to find moment in the rib at η = a/3. Given data: a = 500 mm, b = 250 mm, t = 0.6 mm, A = 500 mm², ℓ = 2000 mm, P = 1000 N."
  },
  "square_cross_section_open_cell_torque.png": {
    "suggested_name": "square_cross_section_open_cell_torque",
    "description": "Square cross-section diagram for open cell analysis under applied torque T_y. Four corners labeled 1, 2, 3, 4 (counterclockwise from bottom left) with shear fluxes q₁, q₂, q₃, q₄. Superscripts indicate open cell (q') and closed cell (q*) contributions shown in red and blue. Coordinate system with y-axis vertical, x-axis horizontal. Torque T_y applied at bottom with arrow. Positive direction (⊕+) indicated at center. Open cell flux equations: q₁' = q₂' = T_y/(2b), q₃' = 0. Moment equilibrium equation (circled ④): LHS = 0, RHS = 2q*ab + 2(T_y/2b)·(ab/2), giving q* = -T_y/(4b). Total fluxes: q₁ = q₁' - q* = T_y/(2b) + T_y/(4b) = (3T_y)/(4b), q₃* = -q* = T_y/(4b), q₂ = q₂' + q* = T_y/(4b), q₄ = -q* = T_y/(4b). Internal action in rib shown with rectangular element: q₁R = (3P)/(4b), q₃R = P/(4b), q₂R = P/(4b), q₄R = P/(4b). Moment equation at η location: M(η) = 2·q₄R(bη/2) + 2q₃R(bη/4) + ... + 2·q₄R(bη/4) - P·η, with M(a/3) = 0."
  }
}