{
  "beam_distributed_load_spring_support_square_section.png": {
    "suggested_name": "beam_distributed_load_spring_support_square_section",
    "description": "Structural system showing a beam with total length 3ℓ divided into two segments: left segment of length 2ℓ and right segment of length ℓ. Left end has fixed support (hatched symbol). At distance 2ℓ from left end, there is a spring support with stiffness k (shown with spring symbol and ground hatching). Right segment carries a triangular distributed load q increasing linearly from zero to maximum intensity, with resultant force W acting downward. Unknown vertical displacement v indicated at spring location. Right side shows beam cross-section: square configuration rotated 45° (diamond orientation) with dimension 'a' on diagonals. Four corner stringers labeled 'A' at vertices, with center region labeled 'A'. Cross-section represents semi-monocoque structure with lumped stringer areas."
  },
  "diamond_cross_section_shear_forces.png": {
    "suggested_name": "diamond_cross_section_shear_forces",
    "description": "Diamond-oriented square cross-section with vertical dimension a/√2 and horizontal dimension a/√2 marked on left side. Four corner nodes shown as filled circles with shear flow q indicated by arrows at each corner pointing tangentially around the perimeter. Central upward arrow labeled T represents applied shear force at shear center. Dimensions show the section has diagonal dimension 'a' (implied from the √2 relationships). This diagram illustrates shear flow distribution in a symmetric thin-walled section subjected to vertical shear force, with equation q = T√2/(4a) relating shear flow to applied force."
  },
  "beam_segment_free_body_diagram.png": {
    "suggested_name": "beam_segment_free_body_diagram",
    "description": "Free body diagram showing beam segment analysis. Top portion shows complete beam with fixed support at left end (q label), triangular distributed load over right segment of length ℓ with resultant W, and coordinate x measured from spring location. Bottom portion shows isolated free body diagram of right segment with internal forces: shear force T (upward arrow on left), moment M (counterclockwise arrow on left), axial force labeled x₂ (leftward arrow), vertical reaction X (upward at spring), and applied loads W + qℓ²/6 (downward) at position X + qℓ/2. Equations shown: T = -(X + qℓ/2) and M = -W - qℓ²/6 - (X + qℓ/2)x. Small horizontal arrow labeled x indicates direction convention."
  },
  "beam_spring_displacement_diagram.png": {
    "suggested_name": "beam_spring_displacement_diagram",
    "description": "Beam diagram showing displacement analysis at spring support. Beam has fixed support at left end (q label), total length 3ℓ (2ℓ + ℓ segments), triangular distributed load on right segment with resultant W. Spring support at distance 2ℓ from left end with stiffness k (shown with spring symbol and ground). Vertical force X acts upward at spring location, with corresponding downward displacement S indicated. Notation shows S = X/k = -5.84 mm, with note that S is positive in downward direction. Final result: v = 5.84 mm. Coordinate system shows x measured from spring location."
  },
  "rectangular_frame_three_beams.png": {
    "suggested_name": "rectangular_frame_three_beams",
    "description": "Rectangular frame structure composed of three beam members forming a U-shape. Horizontal force P applied at upper left corner pointing rightward. Left vertical member labeled \"EA, EJ, ℓ\" with pinned support at bottom (circle with cross symbol). Top horizontal member labeled \"EA, EJ, ℓ\". Right vertical member labeled \"EA, EJ, ℓ\" with pinned support at bottom. Unknown horizontal reaction force H indicated at right support with red arrow pointing rightward and question mark. All three members have identical properties: axial stiffness EA, bending stiffness EJ, and length ℓ. Frame is statically indeterminate with goal to determine reaction H."
  },
  "frame_real_system_beam_elements.png": {
    "suggested_name": "frame_real_system_beam_elements",
    "description": "Real system diagram showing rectangular frame with applied load P (horizontal arrow at upper left) and resulting vertical reaction V = P at lower right. Frame has pinned support at lower left (circle with cross) and shows three beam elements numbered in circles: ① at top horizontal member, ② at right vertical member, and ③ at left vertical member. Coordinate system shows x-axis horizontal (rightward) and vertical axis. Below are free body diagrams for individual beam elements: Beam 1 (left vertical) shows internal forces N (horizontal), M (moment), with x-axis rightward and V upward, equations N = -V and M = -Xx₁. Beam 2 (horizontal) shows forces N (leftward), M (moment), V (upward), with x-axis rightward and xℓ notation, equations N = X and M = -Xℓ - Vx₂."
  },
  "beam_3_dummy_system_diagram.png": {
    "suggested_name": "beam_3_dummy_system_diagram",
    "description": "Beam 3 free body diagram showing vertical member with forces P+X at top (horizontal rightward arrow), V at top (upward arrow), moment notation (V+X)ℓ at top right, internal moment M (curved arrow), and axial force N (downward arrow) at bottom. Equations shown: N = V and M = (P+X)x₃ - (V+X)ℓ. Below is dummy system diagram showing rectangular frame with pinned support at lower left, roller support at lower right (with ground symbol), and unit horizontal force (arrow labeled \"1\") applied at right support. V = 0 indicated at right support. Virtual force expressions listed: Beam 1: δN = 0, δM = -x₁; Beam 2: δN = 1, δM = -ℓ; Beam 3: δN = 0, δM = -ℓ + x₃."
  },
  "two_beam_hinged_spring_system.png": {
    "suggested_name": "two_beam_hinged_spring_system",
    "description": "Two-beam system connected by hinged joint. Left beam (beam #1) has fixed support at left end (hatched symbol), length ℓ, properties EJ and ℓ labeled. At right end of beam #1 is hinged connection (two small circles labeled \"hinge\") with vertical force F applied upward, unknown displacement w indicated with upward arrow and question mark. Below hinge is spring with stiffness k and torsional spring with stiffness kt (shown with rotational spring symbol). Right beam (beam #2) extends horizontally from hinge to fixed support at right end (hatched symbol), length ℓ, properties 2EJ and ℓ labeled. Both beams connected through inextensible hinge joint allowing relative rotation but no translation."
  },
  "two_beam_displacement_field_diagram.png": {
    "suggested_name": "two_beam_displacement_field_diagram",
    "description": "Two-beam system with displacement field notation. Left beam (EJ, ℓ) fixed at left end with coordinate x₁ and displacement field z₁, w₁. Hinged connection at center with vertical force F upward, torsional spring kt, and vertical spring k. Right beam (2EJ, ℓ) extends to fixed support at right end with coordinate x₂ and displacement field z₂, w₂. Displacement expansions shown: w₁ = C₁(x₁/ℓ)² + C₂(x₁/ℓ)³ for left beam (third-order polynomial); w₂ = C₃(x₂/ℓ)² for right beam (second-order polynomial). Text notes that expansions exclude constant and linear terms to satisfy essential boundary conditions w₁(0) = 0 and w₂(0) = 0. Additional essential condition from joint: w₁(ℓ) = w₂(ℓ) = 0, leading to C₁ + C₂ = C₃. Final expanded forms: w₁ = C₁(x₁/ℓ)² + C₂(x₁/ℓ)³ and w₂ = (C₁ + C₂)(2x₂/ℓ)²."
  },
  "three_cell_rectangular_section.png": {
    "suggested_name": "three_cell_rectangular_section",
    "description": "Three-cell rectangular cross-section for torsional stiffness analysis. Section consists of three adjacent rectangular cells arranged horizontally. Overall dimensions: width 3a (three equal segments of width a), height a. Eight corner nodes shown as filled circles at vertices. Vertical dimension 'a' marked on right side, horizontal dimensions 'a' marked below each cell. Section represents thin-walled semi-monocoque structure with panel thickness t and lumped stringer area A at corners (including panel contribution). Problem involves determining torsional stiffness GJ using semi-monocoque approximation with shear modulus G."
  },
  "three_cell_shear_flow_diagram.png": {
    "suggested_name": "three_cell_shear_flow_diagram",
    "description": "Three-cell section with shear flow analysis. Rectangular section divided into three cells, each width a, total height a. Applied torsional moment Mt shown with curved arrow at top center. Each cell has clockwise shear flow indicated: q₁* in left cell, q₂* in center cell, q₃* in right cell (curved arrows with superscript asterisks). Eight corner nodes shown as filled circles. Moment equilibrium equation: 2Ωℓ(q₁* + q₂* + q₃*) = Mt with Ωℓ = a². Compatibility equations for twist rates: 2GΩℓθ₁' = 4aq₁* - aq₂*; 2GΩℓθ₂' = 4aq₂* - aq₁* - aq₃*; 2GΩℓθ₃' = 4aq₃* - aq₂*. Symmetry conditions derived: θ₁' = θ₂' leads to 5q₁* - 5q₂* + q₃* = 0; θ₁' = θ₃' leads to q₁* = q₃*."
  },
  "thin_walled_beam_pressure_load_trapezoidal_section.png": {
    "suggested_name": "thin_walled_beam_pressure_load_trapezoidal_section",
    "description": "Thin-walled beam with uniform pressure loading and trapezoidal cross-section. Left diagram shows side view: beam with fixed support at left end (hatched), divided into six equal segments of length ℓ/6 each. Uniform upward pressure p applied along top surface (shown with upward arrows). Section A marked at ℓ/6 from right end with dashed vertical line. Right diagram shows cross-section A: trapezoidal shape with top width a, bottom width b, height c. Four corner stringers labeled A (lumped area including panel contribution). Panel thickness t. Unknown shear stress τz indicated with question mark at center. Pressure p shown with upward arrows above section. Problem involves determining shear stress at section A using semi-monocoque approximation with load introduced at ribs."
  },
  "thin_walled_beam_shear_flow_solution.png": {
    "suggested_name": "thin_walled_beam_shear_flow_solution",
    "description": "Solution diagram for thin-walled beam shear analysis. Top shows side view transformation: left beam with uniform pressure p becomes equivalent system with concentrated forces F at ribs (F, F, F/2 shown with upward arrows), with section A marked. Total force F = paℓ/6 = 233.33 N. Shear force at section A: T = 5F/2 = 583.33 N. Due to section symmetry, torsional moment about shear center is null. Bottom left shows trapezoidal cross-section with height c, shear force T at top, and shear flow q in inclined panels. Text explains shear flows are readily available by exploiting symmetry. Calculation: q = T/(2c) = 9.72 N/mm. Corresponding shear stress: τ = q/t = 8.10 MPa."
  },
  "cantilever_thin_walled_beam_square_section.png": {
    "suggested_name": "cantilever_thin_walled_beam_square_section",
    "description": "Cantilever thin-walled beam with distributed loading and square cross-section. Left diagram shows 3D perspective: beam fixed at upper end (hatched support), length ℓ, with distributed force per unit length q applied along beam (shown with downward arrows on top surface). Coordinate x measured along beam axis. Section at x = ℓ/6 marked. Beam divided into six equal segments. Right diagram shows square cross-section: side dimension a, uniform panel thickness t at all four sides, corner stringers with lumped area A (including panel contribution) shown as filled circles at four corners. Problem involves determining rotation angle at section x = ℓ/3 using semi-monocoque approximation, assuming load introduced at ribs. Shear modulus G specified."
  },
  "cantilever_beam_force_distribution_solution.png": {
    "suggested_name": "cantilever_beam_force_distribution_solution",
    "description": "Solution showing force distribution in cantilever beam. Left diagram shows beam with distributed load q transforming (arrow labeled \"⇨\") to equivalent rib forces. Right diagram shows discrete forces: F/2 at position ℓ/6, then F, F, F, F, F at subsequent rib locations (all upward arrows), with coordinate x and total length ℓ marked. Text states \"This is a 1-cell section, so the Bredt's formula can be applied.\" Torsional constant calculation: J = 4Ω²/(∮ds/t) = 4a⁴t/(4a) = a³t. Note explains torsion θ' is evaluated by referring to section's shear center, which is readily available due to section symmetry. Bottom shows three square cross-sections: first with shear force T at top, equals sign, second with dot labeled \"sc\" (shear center), plus sign, third with dot labeled \"sc\" and moment Mt = Ta/2 (curved arrow)."
  },
  "beam_rotation_angles_distributed_forces.png": {
    "suggested_name": "beam_rotation_angles_distributed_forces",
    "description": "Beam rotation analysis with distributed rib forces. Top shows cantilever beam fixed at right end (hatched), length ℓ, divided into six segments of ℓ/6 each. Six upward forces applied: F/2 at left end, then F, F, F, F, F at subsequent ribs. Total resultant F = qℓ/6. Two rotation angles marked: θ₁' at second rib from right, θ₂' at rightmost rib. Equations for shear forces: \"For the first bay: T₁ = (5 + ½)F\" and \"For the second bay: T₂ = (4 + ½)F\". Rotation calculations: θ₁' = T₁/(2Ga²t) and θ₂' = T₂/(2Ga²t). Final rotation angle: θ = θ₁'(ℓ/6) + θ₂'(ℓ/6) = 6.02 deg. Diagram shows systematic calculation of twist angle accumulation along beam length."
  }
}