{
  "cantilever_beam_triangular_distributed_load.png": {
    "suggested_name": "cantilever_beam_triangular_distributed_load",
    "description": "Two-dimensional (2D) isostatic cantilever beam system with triangular distributed load. The beam has length ℓ and is fixed at the left end (shown with hatched support symbol preventing translation and rotation) and free at the right end (shown with roller symbol). A linearly varying distributed load is applied along the beam length, increasing from zero at the left to maximum intensity p [N/mm] at the right end, represented by vertical arrows of increasing length. The load intensity function is labeled as f(z) where f(z) = (P/ℓ)·z. A concentrated reaction force R [N] acts vertically upward at the right end. The equivalent load application point is marked at zeq = (2/3)ℓ from the left support. A right-handed coordinate system is shown at the fixed support with y-axis vertical (upward positive), x-axis horizontal (rightward positive), and z-axis pointing out of the page. The resultant force is calculated as R₁ = (4/3)P·ℓ. Additional annotations show this is part of \"LAB 3 - Isostatic Beams Systems II\" with references to 2D and 3D analysis."
  },
  "cantilever_beam_uniform_load_3d.png": {
    "suggested_name": "cantilever_beam_uniform_load_3d",
    "description": "Three-dimensional cantilever beam with uniform distributed load p [N/mm] applied over partial length. The beam has total length ℓ and is fixed at the left end (shown with hatched wall symbol). The uniform load is applied over length c starting at distance c/2 from the fixed end, represented by vertical downward arrows in both elevation view (top left) and 3D isometric view (top right). The 3D view shows the beam as a rectangular cross-section with coordinate system: x-axis along beam length, y-axis vertical, z-axis lateral. Key dimensions labeled include c/2, c, and total length ℓ. The resultant force is R₁ = (4/3)p·c located at x₀ = (4/6)c = (2/3)c - (1/3)c from the fixed end. The fixed-end moment is calculated as Mz = R₁·x₀ = -(4/12)pc². A free body diagram shows reaction forces at the fixed support including moment Mz, vertical reaction RMy, horizontal reaction RMx, and axial reaction Rz. The diagram includes annotations for \"Moment × unit length\" with units [N·mm/mm = N·mm/mm]. Problem context indicates this is for finding reaction forces and internal actions in an isostatic system."
  },
  "3d_beam_system_inclined_member.png": {
    "suggested_name": "3d_beam_system_inclined_member",
    "description": "Three-dimensional (3D) isostatic frame structure consisting of an inclined beam (member 3) connected to a horizontal beam (member 4) with supports at points A and B. The inclined beam has length ℓ and carries a uniform distributed load p·c [N/mm] along its length, shown by vertical downward arrows. Member 3 connects at an angle to the horizontal member at a joint. The horizontal member spans between two roller supports: support A at the left and support B at the right, separated by distances ℓ/4 + ℓ/4 = ℓ/2 total span. A concentrated downward force F is applied at the center of the horizontal beam. A right-handed coordinate system is shown with x-axis horizontal (rightward), y-axis vertical (upward), and z-axis out of page. The problem requires finding reaction forces (RF) and internal actions (AI). Annotations indicate \"this beam is out-of-plane\" referring to member 3. The free body diagram shows reaction force components at supports including RBC, RYC, RXC at point C (top of inclined member), and RXB, RYB, RZA, RYA at the lower supports. The resultant of the distributed load on the inclined member is R₁ = pc·ℓ located at z₀ = ℓ/2. Equilibrium equations are provided for the system including moment equilibrium about point C."
  },
  "angled_beam_distributed_load.png": {
    "suggested_name": "angled_beam_distributed_load",
    "description": "Two-dimensional (2D) frame structure consisting of a horizontal beam connected to an inclined member forming an L-shaped configuration. The horizontal beam has length ℓ and is supported by a roller at the left end (point C, allowing horizontal movement) and a pin connection at point A where it meets the inclined member. The inclined member extends downward at an angle from point A to a pin support at point B (bottom right), with vertical height ℓ. A trapezoidal distributed load is applied to the horizontal beam, varying linearly from intensity p₁ [N/mm] at the left end to intensity p₁ + p₂ at the right end (point A), represented by vertical downward arrows of increasing length. The load intensity increases linearly across the span. A right-handed coordinate system is shown with y-axis vertical (upward), x-axis horizontal (rightward), and z-axis out of page, with origin at point C. The problem requires finding reaction forces and internal actions. Reaction forces are labeled: R₁ at point C (blue upward arrow), R₂ at point A (red upward arrow), and reactions at point B. The diagram shows R₁ = 2p₁ℓ and R₂ = p₂ℓ. The inclined member forms a right triangle with horizontal span ℓ and vertical height ℓ."
  },
  "beam_interface_equilibrium_diagram.png": {
    "suggested_name": "beam_interface_equilibrium_diagram",
    "description": "Free body diagram showing equilibrium at the interface of three structural members meeting at a joint. The diagram depicts a horizontal beam (top) connected to an inclined member (bottom right) at a common node. A right-handed coordinate system is shown with y-axis vertical (upward), x-axis horizontal (rightward), and z-axis out of page. At the joint interface, internal forces are shown: RBC (leftward on horizontal member), RYC (upward on horizontal member), RZC (leftward on inclined member), and RYC (downward on inclined member). The inclined member extends diagonally downward to the right, terminating at point B with reactions RZB (rightward) and RYB (upward). External reactions at the top of the horizontal beam include R₁ (blue, upward) and R₂ (red, upward) labeled as RZA and RYA respectively. The diagram is annotated with \"equilibrium at the interface\" in red text. Equilibrium equations are listed to the right showing force balance in z-direction, y-direction, and moment equilibrium. Below the main diagram are numbered equations (3) through (5) expressing the reaction forces in terms of distributed load parameters p₁ and p₂ and length ℓ, such as RYC = -(2p₁ + (2/3)p₂)ℓ."
  }
}