{
  "multicell_rectangular_section_geometry.png": {
    "suggested_name": "multicell_rectangular_section_geometry",
    "description": "Rectangular multicell cross-section diagram for semi-monocoque beam analysis showing two adjacent cells. The section has overall width 2a (divided into two cells of width a each) and height b. Corner points are labeled with area designations A (stringers). Wall thicknesses are labeled: t₁ for vertical walls and t₂ for horizontal and middle vertical walls. The left cell shows annotations for finding angle θ¹ with red arrows indicating direction around the cell perimeter (marked with x at bottom left corner). The right cell shows blue annotation θ¹. Below the section, dimensions a and a are marked for each cell width. Red annotation M₂ and blue annotation θ¹ appear beneath the section. The diagram includes the note \"Let's find θ¹\" and \"Open Cell Fluxes\" indicating this is part of a torsional analysis problem for multicell sections."
  },
  "cantilever_beam_fixed_support_3d.png": {
    "suggested_name": "cantilever_beam_fixed_support_3d",
    "description": "Three-dimensional perspective view of a cantilever beam with multicell rectangular cross-section. The beam has length ℓ extending from a fixed support (shown with hatching) at the right end to a free end at the left. The cross-section shows three vertical divisions creating two cells, with corner stringers labeled A₁ (outer corners) and A₂ (middle positions). The section has height b and contains vertical webs. A right-handed coordinate system is shown at the free end with x-axis horizontal (red), y-axis vertical (red), and z-axis along the beam length (red), with origin marked. The fixed support is indicated by diagonal hatching pattern on the right face. The beam extends at an angle in the perspective view to show the 3D geometry clearly."
  },
  "closed_cell_flux_distribution.png": {
    "suggested_name": "closed_cell_flux_distribution",
    "description": "Schematic diagram showing shear flow distribution in a two-cell closed section under torsion. The rectangular section is divided into left and right cells with corner nodes marked by circles. Red arrows and labels (q₁*, q₂*) indicate shear flows in the left cell with counterclockwise circulation marked as ⊙. Blue arrows and labels (q₂*) indicate shear flows in the right cell with counterclockwise circulation marked as ⊙. Horizontal arrows at top show opposing flow directions at the shared middle web. The diagram illustrates the closed-cell flux pattern for moment equilibrium analysis. To the right, a small auxiliary sketch shows a rectangular section with left half shaded with diagonal lines and right half outlined with dashed lines, representing the two-cell configuration. Below the main diagram is the text \"Moment Equivalence wrt P\" indicating this relates to moment equilibrium about point P."
  },
  "truss_structure_vertical_load.png": {
    "suggested_name": "truss_structure_vertical_load",
    "description": "Truss structure diagram showing a rectangular frame with diagonal members forming a symmetric configuration. The structure has width a (divided into two equal segments a/2) and height b. Six nodes are present: three along the top edge labeled with stringer areas (³⁄₂A at left, ³⁄₂A at right, and unlabeled center), and three along the bottom edge (A¹ at left, A² at center, A³ at right). Diagonal members connect from bottom corners to the opposite top corners, crossing at the bottom center node. A vertical downward force F is applied at the bottom center node (A²). The coordinate system shows x-axis horizontal (red) and z-axis vertical (red) at the center node. Blue arrows labeled q₁ point upward at the left bottom node. Red arrows labeled γ point upward at top center. Blue label S appears at top right. Dimension markers show a/2 spacing for the two horizontal segments. The structure represents a semi-monocoque section analysis problem."
  },
  "multicell_closed_flux_diagram.png": {
    "suggested_name": "multicell_closed_flux_diagram",
    "description": "Multicell closed section showing shear flow distribution for a three-cell rectangular configuration under torsion. The section has four corner nodes and one center node, with diagonal members connecting corners to center. Shear flows are labeled with superscript asterisks (q₁*, q₂*, q₃*) indicating unknown closed-cell flows. Red labels and arrows (q₁*, q₂*, q₃*) appear on left cell walls showing counterclockwise circulation marked ⊙. Blue labels and arrows (q₁*, q₂*) appear on right cell walls showing counterclockwise circulation marked ⊙. The center node shows multiple flow contributions from adjacent cells. External flows q₁¹, q₂¹, q₃¹ are labeled at corner nodes. Below the diagram is the heading \"Moment Equivalence wrt ②\" with a circled 2, followed by the moment equilibrium equation showing the relationship between applied moment and shear flows times enclosed areas (Ω_CELL). The equation includes terms for all three cells with their respective enclosed areas."
  },
  "symmetric_multicell_flux_structure.png": {
    "suggested_name": "symmetric_multicell_flux_structure",
    "description": "Symmetric multicell structure diagram exploiting symmetry for shear flow analysis. The rectangular section shows two cells with diagonal members forming an X-pattern connecting corners to center node. Due to symmetry, flows are related: q₁ = q₂, q₃ = q₄, q₆ = q₇, and the center diagonal flow qₛ = ∅ (zero). Shear flows are labeled around the perimeter with various colors: red labels (q₁¹, q₂¹, q₃) on left side, blue labels (q₁¹, q₂¹) in interior, and green labels (qₛ, q₃) on diagonals. Arrows indicate flow directions around cells with counterclockwise circulation. A vertical upward arrow appears at the bottom center. The symmetry conditions are explicitly stated: θ₁¹ = ∅, q₂¹ = -q₂* ≈ q*, and qₛ - q₃* = ∅. This diagram demonstrates how symmetry reduces the number of unknown shear flows in multicell torsion analysis."
  }
}