{
  "page_1_img_1.png": {
    "suggested_name": "frame_structure_spring_support_vertical_loads",
    "description": "Rectangular frame structure with spring support (k) at left side and fixed support at bottom left corner. Vertical downward force F applied at top left corner. Frame has total length a (horizontal dimension) and height b (vertical dimension). Three vertical downward forces shown: force at point A (left vertical member), force b at center span, and force b/2 at right side. Coordinate system shows vertical and horizontal orientations. Spring element labeled with m indicating mass or stiffness parameter."
  },
  "page_1_img_2.png": {
    "suggested_name": "frame_structure_distributed_roof_load",
    "description": "Rectangular frame structure with distributed upward load along sloped roof member. Frame divided into three bays labeled 1, 2, and 3 at bottom, with two equal horizontal spans of dimension a. Vertical members labeled 4, 6, and 5 from left to right. Height dimension b shown on left side. Multiple upward arrows indicate distributed load on triangular roof section. Dots at corners indicate pinned or moment connections. Horizontal dimension arrows show span divisions of a and a. Coordinate system with ζ (zeta) axis shown at right."
  },
  "page_2_img_1.png": {
    "suggested_name": "rectangular_frame_moment_loading_member_labels",
    "description": "Rectangular frame structure with total horizontal span of 2a (divided into two equal segments of dimension a each) and height b. Frame members labeled with cross-sectional areas A and thicknesses t₁ and t₂. Concentrated moment M_z shown at bottom center with curved arrow indicating rotational direction. Dots at corners and mid-span indicate connection points. Vertical dimension b shown on left side with bidirectional arrow. Horizontal dimensions shown at top with segment lengths a and a separated by an X mark at center."
  },
  "page_2_img_2.png": {
    "suggested_name": "l_shaped_frame_member_properties",
    "description": "L-shaped frame structure with horizontal member of length x and vertical member of height b. Members labeled with cross-sectional areas (A₁, A₂) and thicknesses (t₁, t₂, t₃). Horizontal member has dimension a at top. Vertical member shows area A₂ with thickness t₂ at upper section and A₁ with thickness t₁ at lower section. Horizontal member shows area A with thickness t₃ on left portion and A₁ with thickness t₁ on right portion. Dots indicate connection points at corners and intermediate locations. Coordinate system shows x-axis horizontal and b-axis vertical."
  },
  "page_3_img_1.png": {
    "suggested_name": "beam_fixed_roller_supports_distributed_load",
    "description": "Beam with fixed support at left end (labeled EA, EI) and roller support at right end. Distributed downward load q applied over segment A of the beam. Beam total length ℓ with segment ℓ₂ marked between supports. Right support shows force F_x with notation indicating F_x = 000/111. Coordinate system shows y-axis vertical and x-axis horizontal at bottom left. Fixed support prevents translation and rotation while roller support allows horizontal movement."
  },
  "page_3_img_2.png": {
    "suggested_name": "beam_fixed_spring_support_triangular_load",
    "description": "Beam with fixed support at left end and spring support (k) at right end point A. Triangular distributed load with linearly increasing intensity from left to right, shown by multiple downward arrows of increasing length. Load intensity labeled as k along the sloped upper boundary. Beam length ℓ shown with horizontal dimension arrow. Spring element labeled EI_y on left side. Coordinate system shows y-axis vertical and x-axis horizontal at bottom left. Fixed support shown with hatched ground symbol."
  }
}